import React from 'react';
import ContentPage from '../../tool/ContentPage/ContentPage';
import ContentTopPage from "../../tool/ContentTopPage/ContentTopPage";

const WebtoonPage = () => {
    return (
        <>
            <ContentTopPage
                type="/webtoon"
                title="웹툰 상위 10"
                tabs={['실시간 랭킹', '월간 랭킹', '누적 랭킹']}
            />
            <ContentPage
                type="/webtoon"
                title="웹툰"
                genres={[
                    { name: '전체', subGenres: [] },
                    { name: '플랫폼 관련', subGenres: ['RIDI_ONLY', '리다무'] },
                    { name: '콘텐츠 형식', subGenres: ['웹소설', '연재중', '연재완결', '19금'] },
                    { name: '평점 및 리뷰', subGenres: ['평점4점이상', '리뷰500개이상', '별점500개이상', '리뷰100개이상', '별점100개이상'] },
                    {
                        name: '장르',
                        subGenres: [
                            '퓨전판타지', '현대판타지', '대체역사', '판타지', '무협', '로맨스',
                            'SF', '스포츠물', '코믹/개그물', '공포_미스터리', '다크판타지',
                            '정통판타지', '로맨스판타지', '선협', '서양판타지', '정통', '드라마'
                        ]
                    },
                    {
                        name: '설정 및 테마',
                        subGenres: [
                            '학원/아카데미', '빙의물', '회귀물', '성장물', '사이다물', '피폐물',
                            '전쟁물', '경영물', '차원이동물', '이세계', '생존물', '모험가',
                            '디스토피아', '아포칼립스', '포스트아포칼립스', '탑등반물', '생존',
                            '서바이벌', '청부업자', '배틀', '던전', '인터넷방송', '게임시스템',
                            '경영', '게임', '재벌', '정령사', '마법사', '아카데미', '귀환물',
                            '고인물', '이종족', '퓨전', '경찰', '라이트노벨', '빌런캐',
                            '회사원', '가수', '성직자', '서포터', '요리사', '군인', '고구마',
                            '육성', '힐링', '먹방/요리', '악마', '레이드', '창', '노력가',
                            '해결사', '삼국지', 'BJ', '암살자', '만능', '얼굴천재', '칼잡이',
                            '용병', '아이템', '후회', '연예계', '무공', '검은머리', '음악',
                            '성좌', '몬스터', '축구', '소드마스터', '오컬트', '스팀펑크',
                            '조력자', '요리', '농부', '크툴루', '천재', '드래곤', '사이버펑크',
                            '배우', '이능력', '전쟁', '플레이어', '군주', '마왕', '환생', '계략캐',
                            '사연캐', '범죄', '농사', '조선', '스포츠', '대한제국', '천마',
                            '능력자', '마나', '영지', '전쟁_밀리터리', '매니저', '신무협',
                            '영웅/신화', '무인', '로맨스', '복수', '마법', '하렘', '암흑가',
                            '교수', '신', '착각', '게이트', '기갑', '정치', '헌터', '희생캐'
                            ,'시스템'
                        ]
                    },
                    {
                        name: '캐릭터 유형 및 속성',
                        subGenres: [
                            '동료/케미', '망나니', '먼치킨', '얼굴천재', '천재', '헌터', '마법사',
                            '왕족/귀족', '귀환', '착각물', '각성', '노력가', '빌런캐', '악마',
                            '용사', '네크로맨서', '성직자', '서포터', '요리사', '군인', '고구마',
                            '만능', '검사', '암살자', '칼잡이', '용병', '아이템', '후회',
                            '능력자', '외유내강캐', '연예인', '드래곤', '사이버펑크', '배우',
                            '이능력', '플레이어', '군주', '마왕', '계략캐', '범죄', '복수', '아이돌',
                            '연예계물', '구원', '성장', '마나', '영지', '신무협', '영웅/신화',
                            '무인', '마법', '하렘', '암흑가', '교수', '신', '착각', '게이트',
                            '검사_법', '마계', '기갑', '희생캐'
                        ]
                    }
                ]}
                tabs={['실시간 랭킹', '월간 랭킹', '누적 랭킹']}
            />
        </>
    );
}

export default WebtoonPage;
